code_list_shifrovanie_ENG = [("A", "Z"), ("B", "Y"), ("C", "X"), ("D", "W"), ("E", "V"), ("F", "U"),
             ("G", "T"), ("H", "S"), ("I", "R"), ("J", "Q"), ("K", "P"), ("L", "O"),
             ("M", "N"), ("N", "M"), ("O", "L"), ("P", "K"), ("Q", "J"), ("R", "I"),
             ("S", "H"), ("T", "G"), ("U", "F"), ("V", "E"), ("W", "D"), ("X", "C"),
             ("Y", "B"), ("Z", "A"), (" ", "?"), (".", " "), (",", "!"), ("!", "#"),
             (":", "@"), (";", "%"), ("?", "{"), ("-", "^"),("_", "}")]
 
code_list_deshifrovanie_ENG = [("Z", "A"), ("Y", "B"), ("X", "C"), ("W", "D"), ("V", "E"), ("U", "F"),
             ("T", "G"), ("S", "H"), ("R", "I"), ("Q", "J"), ("P", "K"), ("O", "L"),
             ("N", "M"), ("M", "N"), ("L", "O"), ("K", "P"), ("J", "Q"), ("I", "R"),
             ("H", "S"), ("G", "T"), ("F", "U"), ("E", "V"), ("D", "W"), ("C", "X"),
             ("B", "Y"), ("A", "Z"), ("?", " "), (" ", "."), ("!", ","), ("#", "!"),
             ("@", ":"), ("%", ";"), ("{", "?"), ("^", "-"),("}", "_")]

code_list_shifrovanie_RU = [("А", "Я"), ("Б", "Ю"), ("В", "Э"), ("Г", "Ь"), ("Д", "Ы"), ("Е", "Ъ"),
("Ё", "Ш"), ("Ж", "Щ"), ("З", "Ч"), ("И", "Ц"), ("Й", "Ч"), ("К", "Ф"),
("Л", "У"), ("М", "Т"), ("Н", "С"), ("О", "Р"), ("П", "П"), ("Р", "О"),
("С", "Н"), ("Т", "М"), ("У", "Л"), ("Ф", "К"), ("Х", "Й"), ("Ц", "И"),
("Ч", "З"), ("Ш", "Ж"),("Щ", "Ё"), ("Ъ", "Е"), ("Ы", "Д"), ("Ь", "Г"), ("Э", "В"), ("Ю", "Б"),
("Я", "А"), (" ", "?"), (".", " "), (",", "!"), ("!", "#"),
(":", "@"), (";", "%"), ("?", "{"), ("-", "^"),("_", "}")]

code_list_deshifrovanie_RU = [("Я", "А"), ("Ю", "Б"), ("Э", "В"), ("Ь", "Г"), ("Ы", "Д"), ("Ъ", "Е"),
("Ш", "Ё"), ("Щ", "Ж"), ("Ч", "З"), ("Ц", "И"), ("Ч", "Й"), ("Ф", "К"),
("У", "Л"), ("Т", "М"), ("С", "Н"), ("Р", "О"), ("П", "П"), ("О", "Р"),
("Н", "С"), ("М", "Т"), ("Л", "У"), ("К", "Ф"), ("Й", "Х"), ("И", "Ц"),
("З", "Ч"), ("Ж", "Ш"),("Ё", "Щ"), ("Е", "Ъ"), ("Д", "Ы"), ("Г", "Ь"), ("В", "Э"), ("Б", "Ю"),
("А", "Я"), ("?", " "), (" ", "."), ("!", ","), ("#", "!"),
("@", ":"), ("%", ";"), ("{", "?"), ("^", "-"),("}", "_")]
lang = int(input("Lang: 1 - English, 2 - Russian: "))
if lang == 1:
    print("Метод простой подстановки. Выберите функцию")
    vibor = int(input("Шифрование (1), Дешифрование (2). Ваш выбор:"))
    if vibor == 1:
        data = input("Введите текст для шифрования: ")
        print(data.upper().translate(str.maketrans(dict(code_list_shifrovanie_ENG))))
    elif vibor == 2:
        data = input("Введите текст для дешифрования: ")
        print(data.upper().translate(str.maketrans(dict(code_list_deshifrovanie_ENG))))

elif lang == 2:
    print("Метод простой подстановки. Выберите функцию")
    vibor = int(input("Шифрование (1), Дешифрование (2). Ваш выбор:"))
    if vibor == 1:
        data = input("Введите текст для шифрования: ")
        print(data.upper().translate(str.maketrans(dict(code_list_shifrovanie_RU))))
    elif vibor == 2:
        data = input("Введите текст для дешифрования: ")
        print(data.upper().translate(str.maketrans(dict(code_list_deshifrovanie_RU))))

